select *
  from specializations as s
  join specializations_doctors as sd
    on s.id = sd.specializations_id
  join doctors as d
    on sd.doctors_id = d.id;

-- +----+-------------------+--------------------+------------+----+-----------+------------+----------------+-----------+----------+
-- | id | specialization    | specializations_id | doctors_id | id | last_name | first_name | patr_name      | salary    | premium  |
-- +----+-------------------+--------------------+------------+----+-----------+------------+----------------+-----------+----------+
-- |  1 | Анестезиолог      |                  1 |         13 | 13 | Иванова   | Мария      | Романовна      | 116222.00 | 28610.00 |
-- |  3 | Дерматолог        |                  3 |         30 | 30 | Князев    | Руслан     | Максимович     |  83075.00 | 38861.00 |
-- |  3 | Дерматолог        |                  3 |         39 | 39 | Уткин     | Тимофей    | Максимович     |  49330.00 | 27194.00 |
-- |  4 | Диетолог          |                  4 |          4 |  4 | Дьяконова | Екатерина  | Михайловна     |  61477.00 |  9858.00 |
-- |  4 | Диетолог          |                  4 |          9 |  9 | Афанасьев | Иван       | Адамович       |  73389.00 | 28428.00 |
-- |  4 | Диетолог          |                  4 |         50 | 50 | Лопатин   | Марк       | Даниилович     |  40564.00 | 10253.00 |
-- |  4 | Диетолог          |                  4 |         62 | 62 | Скворцова | Елизавета  | Мирославовна   |  75003.00 | 30382.00 |
-- |  5 | Иммунолог         |                  5 |         18 | 18 | Романова  | Анна       | Владимировна   | 107881.00 |     0.00 |
-- |  5 | Иммунолог         |                  5 |         50 | 50 | Лопатин   | Марк       | Даниилович     |  40564.00 | 10253.00 |
-- |  6 | Кардиолог         |                  6 |          2 |  2 | Васильева | Вероника   | Артёмовна      |  58463.00 |     0.00 |
-- |  8 | Нарколог          |                  8 |          5 |  5 | Егорова   | Алёна      | Артёмовна      |  41474.00 |     0.00 |
-- |  8 | Нарколог          |                  8 |         23 | 23 | Семенова  | Полина     | Владиславовна  |  43597.00 |  3753.00 |
-- |  8 | Нарколог          |                  8 |         30 | 30 | Князев    | Руслан     | Максимович     |  83075.00 | 38861.00 |
-- |  7 | Невролог          |                  7 |         10 | 10 | Богданов  | Михаил     | Александрович  |  56007.00 |  7992.00 |
-- |  7 | Невролог          |                  7 |         14 | 14 | Пахомов   | Марк       | Михайлович     |  45166.00 | 15081.00 |
-- |  7 | Невролог          |                  7 |         23 | 23 | Семенова  | Полина     | Владиславовна  |  43597.00 |  3753.00 |
-- |  7 | Невролог          |                  7 |         35 | 35 | Парфенова | Ева        | Евгеньевна     |  34788.00 | 12847.00 |
-- |  7 | Невролог          |                  7 |         54 | 54 | Долгов    | Артём      | Германович     |  80941.00 |     0.00 |
-- |  9 | Онколог           |                  9 |         27 | 27 | Миронов   | Никита     | Матвеевич      |  80562.00 | 21251.00 |
-- |  9 | Онколог           |                  9 |         36 | 36 | Шмелева   | Анна       | Дмитриевна     |  89108.00 |     0.00 |
-- | 10 | Ортопед           |                 10 |         60 | 60 | Леонов    | Егор       | Матвеевич      | 113051.00 | 23022.00 |
-- | 10 | Ортопед           |                 10 |         63 | 63 | Иванов    | Савва      | Дмитриевич     | 100450.00 | 26805.00 |
-- | 11 | Оториноларинголог |                 11 |         51 | 51 | Зайцева   | Таисия     | Марковна       | 102468.00 |  6082.00 |
-- | 12 | Офтальмолог       |                 12 |          5 |  5 | Егорова   | Алёна      | Артёмовна      |  41474.00 |     0.00 |
-- | 12 | Офтальмолог       |                 12 |         14 | 14 | Пахомов   | Марк       | Михайлович     |  45166.00 | 15081.00 |
-- | 12 | Офтальмолог       |                 12 |         44 | 44 | Дроздов   | Степан     | Максимович     |  89440.00 | 11384.00 |
-- | 12 | Офтальмолог       |                 12 |         47 | 47 | Кузнецова | Вероника   | Ярославовна    |  42030.00 |     0.00 |
-- | 12 | Офтальмолог       |                 12 |         52 | 52 | Васильева | Александра | Владимировна   |  59637.00 |     0.00 |
-- | 12 | Офтальмолог       |                 12 |         62 | 62 | Скворцова | Елизавета  | Мирославовна   |  75003.00 | 30382.00 |
-- | 12 | Офтальмолог       |                 12 |         63 | 63 | Иванов    | Савва      | Дмитриевич     | 100450.00 | 26805.00 |
-- | 12 | Офтальмолог       |                 12 |         67 | 67 | Леонова   | Татьяна    | Александровна  |  68419.00 |  5104.00 |
-- | 13 | Реаниматолог      |                 13 |          3 |  3 | Копылова  | Ульяна     | Кирилловна     |  64267.00 | 18326.00 |
-- | 13 | Реаниматолог      |                 13 |         15 | 15 | Суханов   | Павел      | Даниилович     | 118941.00 | 30886.00 |
-- | 13 | Реаниматолог      |                 13 |         34 | 34 | Яковлев   | Иван       | Константинович |  55731.00 |  7172.00 |
-- | 15 | Стоматолог        |                 15 |         18 | 18 | Романова  | Анна       | Владимировна   | 107881.00 |     0.00 |
-- | 15 | Стоматолог        |                 15 |         23 | 23 | Семенова  | Полина     | Владиславовна  |  43597.00 |  3753.00 |
-- | 17 | Травматолог       |                 17 |         46 | 46 | Малышева  | Арина      | Святославовна  | 105845.00 |     0.00 |
-- | 17 | Травматолог       |                 17 |         59 | 59 | Воробьева | Ева        | Фёдоровна      |  86371.00 | 37359.00 |
-- | 17 | Травматолог       |                 17 |         63 | 63 | Иванов    | Савва      | Дмитриевич     | 100450.00 | 26805.00 |
-- | 18 | Уролог            |                 18 |         26 | 26 | Баранова  | Ярослава   | Никитична      |  35830.00 | 34737.00 |
-- | 18 | Уролог            |                 18 |         40 | 40 | Леонтьева | Василиса   | Львовна        | 115851.00 |     0.00 |
-- | 18 | Уролог            |                 18 |         54 | 54 | Долгов    | Артём      | Германович     |  80941.00 |     0.00 |
-- | 18 | Уролог            |                 18 |         58 | 58 | Волкова   | Ева        | Егоровна       |  80645.00 | 38444.00 |
-- | 19 | Хирург            |                 19 |         12 | 12 | Степанова | Александра | Денисовна      |  80145.00 |     0.00 |
-- | 19 | Хирург            |                 19 |         27 | 27 | Миронов   | Никита     | Матвеевич      |  80562.00 | 21251.00 |
-- | 19 | Хирург            |                 19 |         35 | 35 | Парфенова | Ева        | Евгеньевна     |  34788.00 | 12847.00 |
-- | 19 | Хирург            |                 19 |         43 | 43 | Русаков   | Владимир   | Ильич          |  51046.00 |     0.00 |
-- | 19 | Хирург            |                 19 |         59 | 59 | Воробьева | Ева        | Фёдоровна      |  86371.00 | 37359.00 |
-- | 20 | Эндокринолог      |                 20 |         39 | 39 | Уткин     | Тимофей    | Максимович     |  49330.00 | 27194.00 |
-- | 20 | Эндокринолог      |                 20 |         57 | 57 | Михайлова | Александра | Даниэльевна    |  53752.00 |     0.00 |
-- +----+-------------------+--------------------+------------+----+-----------+------------+----------------+-----------+----------+
-- 50 rows in set (0.0071 sec)


    select *
      from specializations as s
      join specializations_doctors as sd
        on s.id = sd.specializations_id
right join doctors as d
        on sd.doctors_id = d.id;

-- +------+-------------------+--------------------+------------+----+------------+------------+----------------+-----------+----------+
-- | id   | specialization    | specializations_id | doctors_id | id | last_name  | first_name | patr_name      | salary    | premium  |
-- +------+-------------------+--------------------+------------+----+------------+------------+----------------+-----------+----------+
-- | NULL | NULL              |               NULL |       NULL |  1 | Коновалова | Василиса   | Данииловна     |  68228.00 |     0.00 |
-- |    6 | Кардиолог         |                  6 |          2 |  2 | Васильева  | Вероника   | Артёмовна      |  58463.00 |     0.00 |
-- |   13 | Реаниматолог      |                 13 |          3 |  3 | Копылова   | Ульяна     | Кирилловна     |  64267.00 | 18326.00 |
-- |    4 | Диетолог          |                  4 |          4 |  4 | Дьяконова  | Екатерина  | Михайловна     |  61477.00 |  9858.00 |
-- |    8 | Нарколог          |                  8 |          5 |  5 | Егорова    | Алёна      | Артёмовна      |  41474.00 |     0.00 |
-- |   12 | Офтальмолог       |                 12 |          5 |  5 | Егорова    | Алёна      | Артёмовна      |  41474.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL |  6 | Гусева     | Любовь     | Тимофеевна     |  66624.00 | 34838.00 |
-- | NULL | NULL              |               NULL |       NULL |  7 | Румянцева  | Вера       | Александровна  |  88402.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL |  8 | Горбачев   | Дмитрий    | Александрович  | 100680.00 |     0.00 |
-- |    4 | Диетолог          |                  4 |          9 |  9 | Афанасьев  | Иван       | Адамович       |  73389.00 | 28428.00 |
-- |    7 | Невролог          |                  7 |         10 | 10 | Богданов   | Михаил     | Александрович  |  56007.00 |  7992.00 |
-- | NULL | NULL              |               NULL |       NULL | 11 | Соколова   | София      | Михайловна     | 111419.00 | 23950.00 |
-- |   19 | Хирург            |                 19 |         12 | 12 | Степанова  | Александра | Денисовна      |  80145.00 |     0.00 |
-- |    1 | Анестезиолог      |                  1 |         13 | 13 | Иванова    | Мария      | Романовна      | 116222.00 | 28610.00 |
-- |    7 | Невролог          |                  7 |         14 | 14 | Пахомов    | Марк       | Михайлович     |  45166.00 | 15081.00 |
-- |   12 | Офтальмолог       |                 12 |         14 | 14 | Пахомов    | Марк       | Михайлович     |  45166.00 | 15081.00 |
-- |   13 | Реаниматолог      |                 13 |         15 | 15 | Суханов    | Павел      | Даниилович     | 118941.00 | 30886.00 |
-- | NULL | NULL              |               NULL |       NULL | 16 | Лебедев    | Платон     | Михайлович     |  76837.00 | 30960.00 |
-- | NULL | NULL              |               NULL |       NULL | 17 | Воронина   | Елизавета  | Сергеевна      |  58077.00 | 34802.00 |
-- |    5 | Иммунолог         |                  5 |         18 | 18 | Романова   | Анна       | Владимировна   | 107881.00 |     0.00 |
-- |   15 | Стоматолог        |                 15 |         18 | 18 | Романова   | Анна       | Владимировна   | 107881.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 19 | Комаров    | Дмитрий    | Тимофеевич     |  46621.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 20 | Кузин      | Даниил     | Миронович      |  41278.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 21 | Журавлева  | Аделина    | Степановна     |  97894.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 22 | Савин      | Родион     | Михайлович     | 114117.00 | 24312.00 |
-- |    7 | Невролог          |                  7 |         23 | 23 | Семенова   | Полина     | Владиславовна  |  43597.00 |  3753.00 |
-- |    8 | Нарколог          |                  8 |         23 | 23 | Семенова   | Полина     | Владиславовна  |  43597.00 |  3753.00 |
-- |   15 | Стоматолог        |                 15 |         23 | 23 | Семенова   | Полина     | Владиславовна  |  43597.00 |  3753.00 |
-- | NULL | NULL              |               NULL |       NULL | 24 | Фролов     | Даниил     | Давидович      |  99801.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 25 | Сорокин    | Богдан     | Степанович     |  31408.00 |     0.00 |
-- |   18 | Уролог            |                 18 |         26 | 26 | Баранова   | Ярослава   | Никитична      |  35830.00 | 34737.00 |
-- |    9 | Онколог           |                  9 |         27 | 27 | Миронов    | Никита     | Матвеевич      |  80562.00 | 21251.00 |
-- |   19 | Хирург            |                 19 |         27 | 27 | Миронов    | Никита     | Матвеевич      |  80562.00 | 21251.00 |
-- | NULL | NULL              |               NULL |       NULL | 28 | Березина   | Николь     | Владиславовна  | 119991.00 |  1024.00 |
-- | NULL | NULL              |               NULL |       NULL | 29 | Никулин    | Ярослав    | Михайлович     | 105903.00 | 29385.00 |
-- |    3 | Дерматолог        |                  3 |         30 | 30 | Князев     | Руслан     | Максимович     |  83075.00 | 38861.00 |
-- |    8 | Нарколог          |                  8 |         30 | 30 | Князев     | Руслан     | Максимович     |  83075.00 | 38861.00 |
-- | NULL | NULL              |               NULL |       NULL | 31 | Лобанова   | Евгения    | Антоновна      |  33689.00 | 18446.00 |
-- | NULL | NULL              |               NULL |       NULL | 32 | Астахова   | Альбина    | Максимовна     |  93215.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 33 | Ершова     | Алиса      | Александровна  |  53314.00 |     0.00 |
-- |   13 | Реаниматолог      |                 13 |         34 | 34 | Яковлев    | Иван       | Константинович |  55731.00 |  7172.00 |
-- |    7 | Невролог          |                  7 |         35 | 35 | Парфенова  | Ева        | Евгеньевна     |  34788.00 | 12847.00 |
-- |   19 | Хирург            |                 19 |         35 | 35 | Парфенова  | Ева        | Евгеньевна     |  34788.00 | 12847.00 |
-- |    9 | Онколог           |                  9 |         36 | 36 | Шмелева    | Анна       | Дмитриевна     |  89108.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 37 | Андреев    | Арсений    | Данилович      |  76232.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 38 | Фокин      | Владимир   | Артёмович      | 103594.00 |     0.00 |
-- |    3 | Дерматолог        |                  3 |         39 | 39 | Уткин      | Тимофей    | Максимович     |  49330.00 | 27194.00 |
-- |   20 | Эндокринолог      |                 20 |         39 | 39 | Уткин      | Тимофей    | Максимович     |  49330.00 | 27194.00 |
-- |   18 | Уролог            |                 18 |         40 | 40 | Леонтьева  | Василиса   | Львовна        | 115851.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 41 | Малахов    | Глеб       | Иванович       |  35524.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 42 | Андреева   | Елизавета  | Денисовна      |  56665.00 | 25695.00 |
-- |   19 | Хирург            |                 19 |         43 | 43 | Русаков    | Владимир   | Ильич          |  51046.00 |     0.00 |
-- |   12 | Офтальмолог       |                 12 |         44 | 44 | Дроздов    | Степан     | Максимович     |  89440.00 | 11384.00 |
-- | NULL | NULL              |               NULL |       NULL | 45 | Горюнов    | Николай    | Миронович      |  50036.00 | 28098.00 |
-- |   17 | Травматолог       |                 17 |         46 | 46 | Малышева   | Арина      | Святославовна  | 105845.00 |     0.00 |
-- |   12 | Офтальмолог       |                 12 |         47 | 47 | Кузнецова  | Вероника   | Ярославовна    |  42030.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 48 | Шишкина    | Ксения     | Матвеевна      |  42676.00 | 24876.00 |
-- | NULL | NULL              |               NULL |       NULL | 49 | Лебедева   | Ева        | Дмитриевна     |  55059.00 |     0.00 |
-- |    4 | Диетолог          |                  4 |         50 | 50 | Лопатин    | Марк       | Даниилович     |  40564.00 | 10253.00 |
-- |    5 | Иммунолог         |                  5 |         50 | 50 | Лопатин    | Марк       | Даниилович     |  40564.00 | 10253.00 |
-- |   11 | Оториноларинголог |                 11 |         51 | 51 | Зайцева    | Таисия     | Марковна       | 102468.00 |  6082.00 |
-- |   12 | Офтальмолог       |                 12 |         52 | 52 | Васильева  | Александра | Владимировна   |  59637.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 53 | Сухарева   | Элина      | Ярославовна    |  32721.00 | 17141.00 |
-- |    7 | Невролог          |                  7 |         54 | 54 | Долгов     | Артём      | Германович     |  80941.00 |     0.00 |
-- |   18 | Уролог            |                 18 |         54 | 54 | Долгов     | Артём      | Германович     |  80941.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 55 | Фомина     | Ксения     | Васильевна     |  97945.00 | 15481.00 |
-- | NULL | NULL              |               NULL |       NULL | 56 | Миронова   | Алина      | Ильинична      |  43388.00 |     0.00 |
-- |   20 | Эндокринолог      |                 20 |         57 | 57 | Михайлова  | Александра | Даниэльевна    |  53752.00 |     0.00 |
-- |   18 | Уролог            |                 18 |         58 | 58 | Волкова    | Ева        | Егоровна       |  80645.00 | 38444.00 |
-- |   17 | Травматолог       |                 17 |         59 | 59 | Воробьева  | Ева        | Фёдоровна      |  86371.00 | 37359.00 |
-- |   19 | Хирург            |                 19 |         59 | 59 | Воробьева  | Ева        | Фёдоровна      |  86371.00 | 37359.00 |
-- |   10 | Ортопед           |                 10 |         60 | 60 | Леонов     | Егор       | Матвеевич      | 113051.00 | 23022.00 |
-- | NULL | NULL              |               NULL |       NULL | 61 | Соколов    | Андрей     | Фёдорович      | 103977.00 |     0.00 |
-- |    4 | Диетолог          |                  4 |         62 | 62 | Скворцова  | Елизавета  | Мирославовна   |  75003.00 | 30382.00 |
-- |   12 | Офтальмолог       |                 12 |         62 | 62 | Скворцова  | Елизавета  | Мирославовна   |  75003.00 | 30382.00 |
-- |   10 | Ортопед           |                 10 |         63 | 63 | Иванов     | Савва      | Дмитриевич     | 100450.00 | 26805.00 |
-- |   12 | Офтальмолог       |                 12 |         63 | 63 | Иванов     | Савва      | Дмитриевич     | 100450.00 | 26805.00 |
-- |   17 | Травматолог       |                 17 |         63 | 63 | Иванов     | Савва      | Дмитриевич     | 100450.00 | 26805.00 |
-- | NULL | NULL              |               NULL |       NULL | 64 | Злобин     | Илья       | Алексеевич     | 117321.00 | 39939.00 |
-- | NULL | NULL              |               NULL |       NULL | 65 | Леонтьев   | Алексей    | Константинович |  45493.00 |     0.00 |
-- | NULL | NULL              |               NULL |       NULL | 66 | Суслова    | Ольга      | Матвеевна      |  91884.00 | 33145.00 |
-- |   12 | Офтальмолог       |                 12 |         67 | 67 | Леонова    | Татьяна    | Александровна  |  68419.00 |  5104.00 |
-- | NULL | NULL              |               NULL |       NULL | 68 | Белов      | Марк       | Даниилович     |  51634.00 | 16020.00 |
-- | NULL | NULL              |               NULL |       NULL | 69 | Фомин      | Константин | Андреевич      |  63626.00 | 35140.00 |
-- | NULL | NULL              |               NULL |       NULL | 70 | Максимова  | Алиса      | Данииловна     |  57498.00 |     0.00 |
-- +------+-------------------+--------------------+------------+----+------------+------------+----------------+-----------+----------+
-- 85 rows in set (0.0039 sec)


select s.specialization,
       d.last_name,
       v.id
  from specializations as s
  join specializations_doctors as sd
    on s.id = sd.specializations_id
  join doctors as d
    on sd.doctors_id = d.id
  join vacations as v
    on d.id = v.doctors_id;

-- +-------------------+-----------+-----+
-- | specialization    | last_name | id  |
-- +-------------------+-----------+-----+
-- | Анестезиолог      | Иванова   | 809 |
-- | Анестезиолог      | Иванова   | 817 |
-- | Анестезиолог      | Иванова   | 837 |
-- | Дерматолог        | Князев    | 720 |
-- | Дерматолог        | Князев    | 859 |
-- | Дерматолог        | Князев    | 942 |
-- | Дерматолог        | Князев    | 947 |
-- | Дерматолог        | Уткин     | 715 |
-- | Дерматолог        | Уткин     | 940 |
-- | Диетолог          | Дьяконова | 685 |
-- | Диетолог          | Дьяконова | 726 |
-- | Диетолог          | Дьяконова | 762 |
-- | Диетолог          | Афанасьев | 717 |
-- | Диетолог          | Афанасьев | 863 |
-- .......................................
-- +-------------------+-----------+-----+
-- 222 rows in set (0.0012 sec)


  select s.specialization as `специальность`,
         count(*) as `все отпуска`
    from specializations as s
    join specializations_doctors as sd
      on s.id = sd.specializations_id
    join doctors as d
      on sd.doctors_id = d.id
    join vacations as v
      on d.id = v.doctors_id
group by s.specialization
order by `все отпуска`;

-- +-------------------+-------------+
-- | специальность     | все отпуска |
-- +-------------------+-------------+
-- | Оториноларинголог |           2 |
-- | Анестезиолог      |           3 |
-- | Кардиолог         |           3 |
-- | Эндокринолог      |           5 |
-- | Дерматолог        |           6 |
-- | Иммунолог         |           7 |
-- | Онколог           |           8 |
-- | Стоматолог        |           9 |
-- | Ортопед           |          10 |
-- | Нарколог          |          11 |
-- | Диетолог          |          14 |
-- | Реаниматолог      |          15 |
-- | Травматолог       |          17 |
-- | Уролог            |          26 |
-- | Офтальмолог       |          27 |
-- | Хирург            |          28 |
-- | Невролог          |          31 |
-- +-------------------+-------------+
-- 17 rows in set (0.0015 sec)

