select sum(salary)
  from doctors;

-- +-------------+--------------+
-- | sum(salary) | sum(premium) |
-- +-------------+--------------+
-- |  5093737.00 |   1489690.00 |
-- +-------------+--------------+
-- 1 row in set (0.0005 sec)


select 
  sum(salary) as 'расходы оклад', 
  sum(premium) as 'расходы премия', 
  sum(salary) + sum(premium) as 'общий расход'
from doctors;

-- +---------------+----------------+--------------+
-- | расходы оклад | расходы премия | общий расход |
-- +---------------+----------------+--------------+
-- |    5093737.00 |     1489690.00 |   6583427.00 |
-- +---------------+----------------+--------------+
-- 1 row in set (0.0006 sec)


select 
  sum(salary) / count(salary) as 'средний оклад', 
  sum(premium) / count(premium) as 'средняя премия', 
  (sum(salary) + sum(premium)) / count(*) as 'средняя зарплата'
from doctors;

-- +---------------+----------------+------------------+
-- | средний оклад | средняя премия | средняя зарплата |
-- +---------------+----------------+------------------+
-- |  72767.671429 |   21281.285714 |     94048.957143 |
-- +---------------+----------------+------------------+
-- 1 row in set (0.0006 sec)


select 
  ceil(avg(salary)) as 'средний оклад', 
  ceil(avg(premium)) as 'средняя премия', 
  ceil(avg(salary) + avg(premium)) as 'средняя зарплата'
from doctors;

-- +---------------+----------------+------------------+
-- | средний оклад | средняя премия | средняя зарплата |
-- +---------------+----------------+------------------+
-- |         72768 |          21282 |            94049 |
-- +---------------+----------------+------------------+
-- 1 row in set (0.0006 sec)


