drop database if exists joins_test;
create database joins_test;
use joins_test;


create table t1 (
  id1 int primary key auto_increment,
  name1 char(11) not null
);

create table t2 (
  id2 int primary key auto_increment,
  name2 char(11) not null,
  t1_id int references t1 (id)
);


insert into t1
  (name1)
values
  ('т1 строка 1'),
  ('т1 строка 2'),
  ('т1 строка 3');


insert into t2
  (name2, t1_id)
values
  ('т2 строка 1', 1),
  ('т2 строка 2', 1),
  ('т2 строка 3', 1),
  ('т2 строка 4', 2),
  ('т2 строка 5', 2),
  ('т2 строка 6', 2);


select * from t1 join t2 order by id1, id2;

-- +-----+-------------+-----+-------------+-------+
-- | id1 | name1       | id2 | name2       | t1_id |
-- +-----+-------------+-----+-------------+-------+
-- |   1 | т1 строка 1 |   1 | т2 строка 1 |     1 |
-- |   1 | т1 строка 1 |   2 | т2 строка 2 |     1 |
-- |   1 | т1 строка 1 |   3 | т2 строка 3 |     1 |
-- |   1 | т1 строка 1 |   4 | т2 строка 4 |     2 |
-- |   1 | т1 строка 1 |   5 | т2 строка 5 |     2 |
-- |   1 | т1 строка 1 |   6 | т2 строка 6 |     2 |
-- |   2 | т1 строка 2 |   1 | т2 строка 1 |     1 |
-- |   2 | т1 строка 2 |   2 | т2 строка 2 |     1 |
-- |   2 | т1 строка 2 |   3 | т2 строка 3 |     1 |
-- |   2 | т1 строка 2 |   4 | т2 строка 4 |     2 |
-- |   2 | т1 строка 2 |   5 | т2 строка 5 |     2 |
-- |   2 | т1 строка 2 |   6 | т2 строка 6 |     2 |
-- |   3 | т1 строка 3 |   1 | т2 строка 1 |     1 |
-- |   3 | т1 строка 3 |   2 | т2 строка 2 |     1 |
-- |   3 | т1 строка 3 |   3 | т2 строка 3 |     1 |
-- |   3 | т1 строка 3 |   4 | т2 строка 4 |     2 |
-- |   3 | т1 строка 3 |   5 | т2 строка 5 |     2 |
-- |   3 | т1 строка 3 |   6 | т2 строка 6 |     2 |
-- +-----+-------------+-----+-------------+-------+
-- 18 rows in set (0.0008 sec)


select * from t1 join t2 on id1 = t1_id order by id1, id2;

-- +-----+-------------+-----+-------------+-------+
-- | id1 | name1       | id2 | name2       | t1_id |
-- +-----+-------------+-----+-------------+-------+
-- |   1 | т1 строка 1 |   1 | т2 строка 1 |     1 |
-- |   1 | т1 строка 1 |   2 | т2 строка 2 |     1 |
-- |   1 | т1 строка 1 |   3 | т2 строка 3 |     1 |
-- |   2 | т1 строка 2 |   4 | т2 строка 4 |     2 |
-- |   2 | т1 строка 2 |   5 | т2 строка 5 |     2 |
-- |   2 | т1 строка 2 |   6 | т2 строка 6 |     2 |
-- +-----+-------------+-----+-------------+-------+
-- 6 rows in set (0.0008 sec)


select * from t1 left join t2 on id1 = t1_id order by id1, id2;

-- +-----+-------------+------+-------------+-------+
-- | id1 | name1       | id2  | name2       | t1_id |
-- +-----+-------------+------+-------------+-------+
-- |   1 | т1 строка 1 |    1 | т2 строка 1 |     1 |
-- |   1 | т1 строка 1 |    2 | т2 строка 2 |     1 |
-- |   1 | т1 строка 1 |    3 | т2 строка 3 |     1 |
-- |   2 | т1 строка 2 |    4 | т2 строка 4 |     2 |
-- |   2 | т1 строка 2 |    5 | т2 строка 5 |     2 |
-- |   2 | т1 строка 2 |    6 | т2 строка 6 |     2 |
-- |   3 | т1 строка 3 | NULL | NULL        |  NULL |
-- +-----+-------------+------+-------------+-------+
-- 7 rows in set (0.0007 sec)


insert into t1 (name1) value ('т1 строка 4');

-- Query OK, 1 row affected (0.0101 sec)


select * from t1 left join t2 on id1 = t1_id order by id1, id2;

-- +-----+-------------+------+-------------+-------+
-- | id1 | name1       | id2  | name2       | t1_id |
-- +-----+-------------+------+-------------+-------+
-- |   1 | т1 строка 1 |    1 | т2 строка 1 |     1 |
-- |   1 | т1 строка 1 |    2 | т2 строка 2 |     1 |
-- |   1 | т1 строка 1 |    3 | т2 строка 3 |     1 |
-- |   2 | т1 строка 2 |    4 | т2 строка 4 |     2 |
-- |   2 | т1 строка 2 |    5 | т2 строка 5 |     2 |
-- |   2 | т1 строка 2 |    6 | т2 строка 6 |     2 |
-- |   3 | т1 строка 3 | NULL | NULL        |  NULL |
-- |   4 | т1 строка 4 | NULL | NULL        |  NULL |
-- +-----+-------------+------+-------------+-------+
-- 8 rows in set (0.0007 sec)


